bit-finance/Reports/бит_УдалитьУниверсальныйОтчетИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УдалитьУниверсальныйОтчетИсточникиДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Comment>Настройка пула подключений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СохраненныеНастройки</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНастройки</Name>
					<Comment>Тип настройки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыСохраненныхНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Comment>Ключ объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемыйОбъект</Name>
					<Comment>Настраиваемый объект</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНастройки</Name>
					<Comment>Ключ настройки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_УдалитьУниверсальныйОтчетИсточникиДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИБ

Процедура ОбновитьНастройкиПриПереходеНаНовуюВерсию() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипНастройки", 		 Перечисления.бит_ТипыСохраненныхНастроек.Отчеты);
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", "Отчет.бит_УниверсальныйОтчетИсточникиДанных_Скд");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.ХранилищеНастроек КАК ХранилищеНастроек,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Реквизиты.Ссылка) КАК ПредставлениеСсылки
	|ИЗ
	|	Справочник.бит_СохраненныеНастройки КАК Реквизиты
	|ГДЕ
	|	Реквизиты.ТипНастройки = &ТипНастройки
	|	И Реквизиты.НастраиваемыйОбъект = &НастраиваемыйОбъект
	|АВТОУПОРЯДОЧИВАНИЕ";
				   
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ПредставлениеСсылки = Выборка.ПредставлениеСсылки;
		НачатьТранзакцию();
		Попытка
			
			ОтменитьОбработку = Истина;
			СтруктураНастроек = Выборка.ХранилищеНастроек.Получить();
			
			Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
				
				// Заполним ожидаюмую архитетктуру настроек.
				СохраненныеНастройки = НовыеСохраненныеНастройки();
				ЗаполнитьЗначенияСвойств(СохраненныеНастройки, СтруктураНастроек);
				
				Если ТипЗнч(СохраненныеНастройки.ОтборВОтчете) = Тип("ТаблицаЗначений") Тогда
					СохраненныеНастройки.ОтборВОтчете = Новый ХранилищеЗначения(СохраненныеНастройки.ОтборВОтчете,
																				Новый СжатиеДанных(9));
					ОтменитьОбработку			      = Ложь;
				КонецЕсли;
				
				Если ТипЗнч(СохраненныеНастройки.ТаблицаПараметры) = Тип("ТаблицаЗначений") Тогда
					СохраненныеНастройки.ТаблицаПараметры = Новый ХранилищеЗначения(СохраненныеНастройки.ТаблицаПараметры,
																					Новый СжатиеДанных(9));
					ОтменитьОбработку			     	  = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ОтменитьОбработку Тогда
				ОтменитьТранзакцию();
				Продолжить;			
			КонецЕсли;
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если СправочникОбъект = Неопределено Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			СправочникОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(СохраненныеНастройки, Новый СжатиеДанных(9));
			// Запись обработанного объекта.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(Выборка.Ссылка, ПредставлениеСсылки, ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти // ОбновлениеИБ

// Процедура заполняет дополнительные списки.
// 
// Параметры:
//  СписокПараметровНаФорме - СписокЗначений ИЛИ Неопределено - список параметров на форме.
// 
Процедура ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме) Экспорт
	
	// Список имен параметров СКД, заполняемых пользователем через элементы формы.
	СписокПараметровНаФорме.Добавить("Период", "Период");
	
КонецПроцедуры

// Процедура формирует структуру настроек.
//
Функция НовыеСохраненныеНастройки() Экспорт

	СохраненныеНастройки = Новый Структура;
	СохраненныеНастройки.Вставить("Период", 				   Новый СтандартныйПериод);
	СохраненныеНастройки.Вставить("НастройкаОтчета", 		   Справочники.бит_НастройкиОтчетов.ПустаяСсылка());
	СохраненныеНастройки.Вставить("Язык", 					   Справочники.бит_Языки.ПустаяСсылка());
	СохраненныеНастройки.Вставить("НастройкаПулаПодключений",  Справочники.бит_мпд_НастройкиПуловПодключений.ПустаяСсылка());
	СохраненныеНастройки.Вставить("ОтборВОтчете", 			   Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9)));
	СохраненныеНастройки.Вставить("ТаблицаПараметры", 		   Новый ХранилищеЗначения(Новый ТаблицаЗначений, Новый СжатиеДанных(9)));
	СохраненныеНастройки.Вставить("НастройкиКомпоновщика", 	   Новый НастройкиКомпоновкиДанных);
	СохраненныеНастройки.Вставить("ПользовательскиеНастройки", Новый ПользовательскиеНастройкиКомпоновкиДанных);
	
	Возврат СохраненныеНастройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
